perf/load_testing/space_news_redis.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Clean
      duration: 60
      arrivalRate: 1
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 80
    - name: Plain
      duration: 60
      arrivalRate: 5

scenarios:
  - name: Space News Redis (/redis/space_news)
    flow:
      - get:
          url: '/redis/space_news'